<?
$GLOBALS ['user_education'] = array ('0' => '', '1' => '中小学', '2' => '中专/职业学校', '3' => '大专/本科', '4' => '研究生', '5' => '博士' );

$GLOBALS ['user_income'] = array ('0' => '', '1' => '10000元以上', '2' => '8000--10000元', '3' => '6000--8000元', '4' => '4000--6000元', '5' => '2000--4000元', '6' => '1000--2000元', '7' => '1000元以下' );

$GLOBALS ['user_body'] = array ('0' => '', '1' => '中等', '2' => '运动型', '3' => '丰满', '4' => '苗条' );

$GLOBALS ['user_bloodtype'] = array ('0' => '', '10' => 'A', '20' => 'B', '30' => 'AB', '40' => 'O', '50' => '其它', '60' => '保密' );

$GLOBALS ['user_sexual'] = array ('0' => '', '10' => '异性恋', '20' => '同性恋', '30' => '双性恋' );

$GLOBALS ['user_marital'] = array ('0' => '', '10' => '单身', '20' => '已婚', '30' => '离异' );

$GLOBALS ['user_sex'] = array ('0' => '', '1' => '还没', '2' => '正准备', '3' => '刚刚获得', '4' => '多次了' );

$GLOBALS ['user_whopay'] = array ('0' => '', '10' => '当然是男的', '20' => 'AA制', '30' => '自己', '40' => '对方', '50' => '到时再说' );

$GLOBALS ['user_hobby'] = array ('0' => '', '1' => '吸烟', '2' => '小酌', '3' => '吹牛' );

$GLOBALS ['user_living'] = array ('0' => '', '10' => '学校宿舍', '20' => '和室友一起', '30' => '独居', '40' => '同居', '50' => '和家人一起' );

$GLOBALS ['user_colour'] = array ('0' => '', '10' => '黝黑', '20' => '白皙', '30' => '无法形容' );

$GLOBALS ['user_disport'] = array ('0' => '', '1' => '夜店', '2' => 'FB', '3' => 'K歌', '4' => '追星', '5' => '聊八卦', '6' => '电影', '7' => '动漫', '8' => 'cosplay', '9' => '电玩', '10' => '运动', '11' => '旅游', '12' => '户外', '13' => '数码3C', '14' => '公益志愿者', '15' => '摄影' );

$GLOBALS ['user_ufo'] = array ('0' => '', '10' => '我看过UFO', '20' => 'UFO是真的', '30' => 'UFO是扯淡', '40' => '我曾经被外星人劫持' );

$GLOBALS ['user_use_pc'] = array ('0' => '', '1' => '基本不', '2' => '刚学', '3' => '偶尔', '4' => '不固定', '5' => '整天都在电脑前', '6' => '说不清到啥程度' );

$GLOBALS ['user_hairstyle'] = array ('0' => '', '1' => '很重要', '2' => '随意', '3' => '一直不满意', '4' => '刚换' );

$GLOBALS ['user_humor'] = array ('0' => '', '1' => '不需要', '2' => '自认为有', '3' => '冷笑话大师', '4' => '谁知到呢' );

$GLOBALS ['user_sleep'] = array ('0' => '', '1' => '早睡早起', '2' => '晚睡晚起', '3' => '夜猫子', '4' => '基本不睡', '5' => '梦游' );

$GLOBALS ['user_body2'] = array ('0' => '', '1' => '有耳洞', '2' => '有其他洞', '3' => '有纹身', '4' => '啥都没有' );

$GLOBALS ['user_news'] = array ('0' => '', '10' => '看电视', '20' => '上网', '30' => '道听途说', '40' => '报刊杂志', '50' => '没有' )?>